{"Ticker":"MMM","StockExchange":"NYQ","Name":"3M Company","Industry":"Conglomerates","Sector":"Industrials","LongDescription":"3M Company provides diversified technology services in the United States and internationally. The company operates through four segments: Safety and Industrial; Transportation and Electronics; Health Care; and Consumer. The Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. The Transportation and Electronics segment provides ceramic solutions; attachment tapes, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; and reflective signage for highway, and vehicle safety. The Healthcare segment offers health care procedure coding and reimbursement software; skin, wound care, and infection prevention products and solutions; dentistry and orthodontia solutions; and filtration and purification systems. The Consumer segment provides consumer bandages, braces, supports, and consumer respirators; cleaning products for the home; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in St. Paul, Minnesota.","Website":"https:\/\/www.3m.com","52WeekHigh":126.7786400996,"52WeekLow":86.3300018311,"Volume":2966480}
{"Ticker":"AOS","StockExchange":"NYQ","Name":"A. O. Smith Corporation","Industry":"Specialty Industrial Machinery","Sector":"Industrials","LongDescription":"A. O. Smith Corporation manufactures and markets residential and commercial gas, heat pump and electric water heaters, boilers, tanks, and water treatment products in North America, China, Europe, and India. It operates through two segments, North America and Rest of World. The company offers water heaters for residences, restaurants, hotels, office buildings, laundries, car washes, and small businesses; commercial boilers for hospitals, schools, hotels, and other large commercial buildings, as well as residential boilers for homes, apartments, and condominiums; and water treatment products comprising point-of-entry water softeners, well water solutions, and whole-home water filtration products, on-the-go filtration bottles, point-of-use carbon, and reverse osmosis products for residences, restaurants, hotels, and offices. It also provides commercial water treatment and filtration product; expansion tanks, commercial solar water heating systems, swimming pool and spa heaters, and related products and parts; and electric wall-hung, gas tankless, combi-boiler, and heat pump and solar water heaters. The company offers its products primarily under the A. O. Smith, State, Lochinvar, and water softener brands. It distributes its products through independent wholesale plumbing distributors, as well as through retail channels consisting of hardware and home center chains, and manufacturer representative firms; and offers Aquasana branded products directly to consumers through e-commerce. A. O. Smith Corporation was founded in 1874 and is headquartered in Milwaukee, Wisconsin.","Website":"https:\/\/www.aosmith.com","52WeekHigh":76.6267277767,"52WeekLow":47.7390065364,"Volume":1121320}
{"Ticker":"ABT","StockExchange":"NYQ","Name":"Abbott Laboratories","Industry":"Medical Devices","Sector":"Healthcare","LongDescription":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The Established Pharmaceutical Products segment provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. The Diagnostic Products segment offers laboratory systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, as well as detect and measure infectious agents; point of care systems; cartridges for testing blood; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for use in laboratories. The Nutritional Products segment provides pediatric and adult nutritional products. The Medical Devices segment offers rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; and diabetes care products, as well as neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Website":"https:\/\/www.abbott.com","52WeekHigh":115.1923362286,"52WeekLow":89.6699981689,"Volume":7231200}
{"Ticker":"ABBV","StockExchange":"NYQ","Name":"AbbVie Inc.","Industry":"Drug Manufacturers - General","Sector":"Healthcare","LongDescription":"AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals worldwide. The company offers Humira, a therapy administered as an injection for autoimmune, intestinal Behçet's diseases, and pyoderma gangrenosum; Skyrizi to treat moderate to severe plaque psoriasis, psoriatic disease, and Crohn's disease; Rinvoq, a JAK inhibitor to treat rheumatoid and psoriatic arthritis, ankylosing spondylitis, atopic dermatitis, axial spondyloarthropathy, and ulcerative colitis; Imbruvica for the treatment of adult patients with blood cancers; and Venclexta\/Venclyxto to treat hematological malignancies. It also provides facial injectables, plastics and regenerative medicine, body contouring, and skincare products; Vraylar for depressive disorder; Duopa and Duodopa to treat advanced Parkinson's disease; and Ubrelvy for the acute treatment of migraine with or without aura in adults; Qulipta for episodic migraine. In addition, the company offers Lumigan\/Ganfort and Alphagan\/Combigan for the reduction of elevated intraocular pressure(IOP) in patients with open angle glaucoma (OAG) or ocular hypertension; Restasis, a calcineurin inhibitor immunosuppressant indicated to increase tear production; and eye care products. Further, it provides Mavyret\/Maviret to treat chronic hepatitis C virus (HCV) genotype 1-6 infection and HCV genotype 1 infection; Creon, a pancreatic enzyme therapy; Lupron to treat advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; Linzess\/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; and Synthroid for hypothyroidism. It has collaborations with Calico Life Sciences LLC; REGENXBIO Inc.; I-Mab Biopharma; Genmab A\/S; Janssen Biotech, Inc.; Genentech, Inc.; and California Institute for Biomedical Research (Calibr). The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.","Website":"https:\/\/www.abbvie.com","52WeekHigh":162.7486538958,"52WeekLow":128.240469771,"Volume":4163810}
{"Ticker":"ACN","StockExchange":"NYQ","Name":"Accenture plc","Industry":"Information Technology Services","Sector":"Technology","LongDescription":"Accenture plc, a professional services company, provides strategy and consulting, industry X, song, and technology and operation services worldwide. The company offers application services, including agile transformation, DevOps, application modernization, enterprise architecture, software and quality engineering, data management; intelligent automation comprising robotic process automation, natural language processing, and virtual agents; and application management services, as well as software engineering services; strategy and consulting services; data and analytics strategy, data discovery and augmentation, data management and beyond, data democratization, and industrialized solutions comprising turnkey analytics and artificial intelligence (AI) solutions; metaverse; and sustainability services. It also provides change management, HR transformation and delivery, organization strategy and design, talent strategy and development, and leadership and culture services; digital commerce; infrastructure services, including cloud infrastructure managed, cloud and data center, network, digital workplace, database platforms, service management, and cloud and infrastructure security services; data-enabled operating models; technology consulting and AI services; and technology consulting services. In addition, the company offers engineering and R&D digitization, smart connected products, product as-a-service enablement, capital projects, intelligent asset management, digital industrial workforce, and autonomous robotic systems; business process outsourcing; and services related to technology innovation. Further, it provides cloud, ecosystem, marketing, security, supply chain management, zero-based transformation, customer experience, finance consulting, mergers and acquisitions, and sustainability services. The company was founded in 1951 and is based in Dublin, Ireland.","Website":"https:\/\/www.accenture.com","52WeekHigh":329.0751753675,"52WeekLow":239.9804041532,"Volume":1755670}
{"Ticker":"ADM","StockExchange":"NYQ","Name":"Archer-Daniels-Midland Company","Industry":"Farm Products","Sector":"Consumer Defensive","LongDescription":"Archer-Daniels-Midland Company procures, transports, stores, processes, and merchandises agricultural commodities, products, and ingredients in the United States, Switzerland, the Cayman Islands, Brazil, Mexico, Canada, the United Kingdom, and internationally. The company operates in three segments: Ag Services and Oilseeds, Carbohydrate Solutions, and Nutrition. It originates, merchandises, stores, and transports agricultural raw materials, such as oilseeds and soft seeds. The company also engages in the agricultural commodity and feed product import, export, and distribution; and structured trade finance activities. In addition, it offers vegetable oils and protein meals; ingredients for the food, feed, energy, and industrial customers; crude vegetable oils, salad oils, margarine, shortening, and other food products; and partially refined oils to produce biodiesel and glycols for use in chemicals, paints, and other industrial products. Further, the company provides peanuts, peanut-derived ingredients, and cotton cellulose pulp; sweeteners, corn and wheat starches, syrup, glucose, wheat flour, and dextrose; alcohol and other food and animal feed ingredients; ethyl alcohol and ethanol; corn gluten feed and meal; distillers' grains; and citric acids. Additionally, the company provides natural flavors, flavor systems, natural colors, proteins, emulsifiers, soluble fiber, polyols, hydrocolloids, probiotics, prebiotics, enzymes, and botanical extracts; and other specialty food and feed ingredients; edible beans; formula feeds, and animal health and nutrition products; and contract and private label pet treats and foods. It also offers futures commission merchant; commodity brokerage services; cash margins and securities pledged to commodity exchange clearinghouses; and cash pledged as security under certain insurance arrangements. The company was founded in 1902 and is headquartered in Chicago, Illinois.","Website":"https:\/\/www.adm.com","52WeekHigh":96.4945480324,"52WeekLow":69.5495718085,"Volume":1911040}
{"Ticker":"ADBE","StockExchange":"NMS","Name":"Adobe Inc.","Industry":"Software - Infrastructure","Sector":"Technology","LongDescription":"Adobe Inc., together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, students, workers, marketers, educators, enthusiasts, communicators, and consumers. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through a network of distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.","Website":"https:\/\/www.adobe.com","52WeekHigh":574.4000244141,"52WeekLow":278.2300109863,"Volume":2605840}
{"Ticker":"ADP","StockExchange":"NMS","Name":"Automatic Data Processing, Inc.","Industry":"Staffing & Employment Services","Sector":"Industrials","LongDescription":"Automatic Data Processing, Inc. provides cloud-based human capital management solutions worldwide. It operates in two segments, Employer Services and Professional Employer Organization (PEO). The Employer Services segment offers strategic, cloud-based platforms, and human resources (HR) outsourcing solutions. Its offerings include payroll, benefits administration, talent management, HR management, workforce management, insurance, retirement, and compliance services, as well as integrated HCM solutions. The PEO Services segment provides HR outsourcing solutions to small and mid-sized businesses through a co-employment model. This segment offers benefits package, protection and compliance, talent engagement, expertise, comprehensive outsourcing, and recruitment process outsourcing services. The company was founded in 1949 and is headquartered in Roseland, New Jersey.","Website":"https:\/\/www.adp.com","52WeekHigh":270.4399323734,"52WeekLow":199.2993895855,"Volume":1232820}
{"Ticker":"AES","StockExchange":"NYQ","Name":"The AES Corporation","Industry":"Utilities - Diversified","Sector":"Utilities","LongDescription":"The AES Corporation operates as a diversified power generation and utility company. It owns and\/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries. The company also owns and\/or operates utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors; and generates and sells electricity on the wholesale market. It uses a range of fuels and technologies to generate electricity, including coal, gas, hydro, wind, solar, and biomass; and renewables, such as energy storage and landfill gas. The company owns and\/or operates a generation portfolio of approximately 32,326 megawatts. It has operations in the United States, Puerto Rico, El Salvador, Chile, Colombia, Argentina, Brazil, Mexico, Central America, the Caribbean, Europe, and Asia. The company was formerly known as Applied Energy Services, Inc. and changed its name to The AES Corporation in April 2000. The AES Corporation was incorporated in 1981 and is headquartered in Arlington, Virginia.","Website":"https:\/\/www.aes.com","52WeekHigh":29.2676036018,"52WeekLow":11.4300003052,"Volume":13041400}
{"Ticker":"AFL","StockExchange":"NYQ","Name":"Aflac Incorporated","Industry":"Insurance - Life","Sector":"Financial Services","LongDescription":"Aflac Incorporated, through its subsidiaries, provides supplemental health and life insurance products. It operates in two segments, Aflac Japan and Aflac U.S. The Aflac Japan segment offers cancer, medical, nursing care, work leave, GIFT, and whole and term life insurance products, as well as WAYS and child endowment plans under saving type insurance products in Japan. The Aflac U.S. segment provides cancer, accident, short-term disability, critical illness, hospital indemnity, dental, vision, long-term care and disability, and term and whole life insurance products in the United States. It sells its products through sales associates, brokers, independent corporate agencies, individual agencies, and affiliated corporate agencies. The company was founded in 1955 and is headquartered in Columbus, Georgia.","Website":"https:\/\/www.aflac.com","52WeekHigh":82.0299987793,"52WeekLow":57.5340624065,"Volume":2356590}
{"Ticker":"A","StockExchange":"NYQ","Name":"Agilent Technologies, Inc.","Industry":"Diagnostics & Research","Sector":"Healthcare","LongDescription":"Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The Life Sciences and Applied Markets segment offers liquid chromatography systems and components; liquid chromatography mass spectrometry systems; gas chromatography systems and components; gas chromatography mass spectrometry systems; inductively coupled plasma mass spectrometry instruments; atomic absorption instruments; microwave plasma-atomic emission spectrometry instruments; inductively coupled plasma optical emission spectrometry instruments; raman spectroscopy; cell analysis plate based assays; flow cytometer; real-time cell analyzer; cell imaging systems; microplate reader; laboratory software; information management and analytics; laboratory automation and robotic systems; dissolution testing; vacuum pumps, and measurement technologies. The Diagnostics and Genomics segment provides arrays for DNA mutation detection, genotyping, gene copy number determination, identification of gene rearrangements, DNA methylation profiling, gene expression profiling, next generation sequencing, target enrichment and genetic data management, and interpretation support software; and produces synthesized oligonucleotide. It also offers immunohistochemistry in situ hybridization, and hematoxylin and eosin staining and special staining; consumables, and software for quality control analysis of nucleic acid samples; and reagents for use in turbidimetry and flow cytometry, as well as develops liquid-based pharmacodiagnostics. The Agilent CrossLab segment provides GC and LC columns, sample preparation products, custom chemistries, and laboratory instrument supplies; and startup, operational, training, compliance support, software as a service, asset management, and consultation services. The company markets its products through direct sales, distributors, resellers, manufacturer's representatives, and electronic commerce. Agilent Technologies, Inc. was incorporated in 1999 and is headquartered in Santa Clara, California.","Website":"https:\/\/www.agilent.com","52WeekHigh":159.1357369581,"52WeekLow":106.8199996948,"Volume":1956850}
{"Ticker":"ABNB","StockExchange":"NMS","Name":"Airbnb, Inc.","Industry":"Travel Services","Sector":"Consumer Cyclical","LongDescription":"Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. The company's marketplace model connects hosts and guests online or through mobile devices to book spaces and experiences. It primarily offers private rooms, primary homes, or vacation homes. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.","Website":"https:\/\/www.airbnb.com","52WeekHigh":154.9499969482,"52WeekLow":81.9100036621,"Volume":4527150}
{"Ticker":"APD","StockExchange":"NYQ","Name":"Air Products and Chemicals, Inc.","Industry":"Specialty Chemicals","Sector":"Basic Materials","LongDescription":"Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and related services in the Americas, Asia, Europe, the Middle East, India, and internationally. The company produces atmospheric gases, including oxygen, nitrogen, and argon; process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, and syngas; specialty gases; and equipment for the production or processing of gases comprising air separation units and non-cryogenic generators for customers in various industries, including refining, chemical, manufacturing, electronics, magnetic resonance imaging, energy production, medical, food, and metals. It also designs and manufactures equipment for air separation, hydrocarbon recovery and purification, natural gas liquefaction, and liquid helium and liquid hydrogen transport and storage. The company was founded in 1940 and is headquartered in Allentown, Pennsylvania.","Website":"https:\/\/www.airproducts.com","52WeekHigh":320.9078036376,"52WeekLow":230.2105288978,"Volume":772620}
{"Ticker":"AKAM","StockExchange":"NMS","Name":"Akamai Technologies, Inc.","Industry":"Software - Infrastructure","Sector":"Technology","LongDescription":"Akamai Technologies, Inc. provides cloud services for securing, delivering, and computing content, applications, and software over the internet in the United States and internationally. The company offers cloud solutions to keep infrastructure, websites, applications, application programming interfaces, and users safe from various cyberattacks and online threats while enhancing performance. It also provides web and mobile performance solutions to enable dynamic websites and applications; media delivery solutions, including video streaming and video player services, game and software delivery, broadcast operations, authoritative domain name system, resolution, and data and analytics; and cloud computing services, such as compute, storage, networking, database, and container management services to build, deploy, and secure applications and workloads. In addition, the company offers carrier offerings, including cybersecurity protection, parental controls, DNS infrastructure and content delivery solutions; and an array of service and support to assist customers with integrating, configuring, optimizing, and managing its offerings. It sells its solutions through direct sales and service organizations, as well as through various channel partners. The company was incorporated in 1998 and is headquartered in Cambridge, Massachusetts.","Website":"https:\/\/www.akamai.com","52WeekHigh":109.2399978638,"52WeekLow":70.6500015259,"Volume":1245530}
{"Ticker":"ALK","StockExchange":"NYQ","Name":"Alaska Air Group, Inc.","Industry":"Airlines","Sector":"Industrials","LongDescription":"Alaska Air Group, Inc., through its subsidiaries, operated airlines. The company operates through three segments: Mainline, Regional, and Horizon. The company offers scheduled air transportation services on Boeing and Airbus jet aircraft for passengers and cargo throughout the United States, and in parts of Mexico, Costa Rica, and Belize; and for passengers across a shorter distance network within the United States and Canada. Alaska Air Group, Inc. was founded in 1932 and is based in Seattle, Washington.","Website":"https:\/\/www.alaskaair.com","52WeekHigh":57.1800003052,"52WeekLow":32.2512016296,"Volume":2467030}
